[
    {
        "id": "20250723043011",
        "title": "“Guardians of the Shrine” – My Ode to Pattachitra Tradition",
        "content": "Each brushstroke I lay in Pattachitra is more than decoration — it’s ritual. It connects me to centuries of storytellers who, with pigment and patience, preserved the epics of our land.\n\nMy latest work, Guardians of the Shrine, illustrates Jagannath flanked by celestial sentinels. Painted on a cloth scroll prepared with chalk and gum, the surface feels like aged parchment — ideal for intricate detailing.\n\nI work with natural colors — lamp black, indigo, and vermilion — all hand-prepared from minerals, fruits, and shells. There's a calmness in grinding the pigments, in knowing I’m not just painting, I’m preserving.\n\nThe ornate borders tell their own tale, framing the divine scene like the carved entrance to a temple. There is symmetry, rhythm, and reverence in every line.\n\nFor me, art isn't just creation — it’s conservation. Through Pattachitra, I become part of an unbroken chain of devotion that stretches across generations.",
        "author": "Riya Sharma",
        "image": null,
        "timestamp": "2025-07-23 04:30"
    },
    {
        "id": "20250729225115",
        "title": "Celestial Courtyard – A Madhubani Tribute",
        "content": "Madhubani art speaks my language — one of nature, culture, and quiet devotion. What began as sketching became my journey into the vibrant traditions of Mithila, where geometry meets mythology.\nCelestial Courtyard features divine beings gathered around a peacock, framed by symbolic borders. Painted with natural pigments and bamboo pens on handmade paper, this piece reflects the spiritual harmony found in folk heritage.\n\nFor me, every stroke preserves a tradition. Through Madhubani, I share not just artwork, but a lineage of expression rooted in India’s soul.",
        "author": "Riya Sharma",
        "image": "D:\\Brush and soul\\pages\\..\\uploads\\blog_20250729225115_Madhubani.jpg",
        "timestamp": "2025-07-29 22:51"
    }
]