[
    {
        "id": "20250723020318",
        "title": "Celestial Courtyard – A Madhubani Tribute",
        "content": "Madhubani art speaks my language — one of nature, culture, and quiet devotion. What began as sketching became my journey into the vibrant traditions of Mithila, where geometry meets mythology.\n\nCelestial Courtyard features divine beings gathered around a peacock, framed by symbolic borders. Painted with natural pigments and bamboo pens on handmade paper, this piece reflects the spiritual harmony found in folk heritage.\n\nFor me, every stroke preserves a tradition. Through Madhubani, I share not just artwork, but a lineage of expression rooted in India’s soul",
        "author": "Riya Sharma",
        "image": "uploads\\blog_20250723020318_Capture1.JPG",
        "timestamp": "2025-07-23 02:03:18.201894"
    },
    {
        "id": "20250723025647",
        "title": "Lotus Pond and Divine Harmony",
        "content": "Painting has always been a form of prayer for me—a way to keep the rituals, stories, and dreams of Mithila alive. Each morning, I gather my colors ground from flowers and leaves, and prepare my paper with a gentle wash, echoing the traditions my mother taught me. I draw with my bamboo twig, letting the lines flow into peacocks, lotus ponds, and stories of Krishna or Sita on their journeys.\n\nMadhubani art is more than decoration: it is memory, devotion, and community. From the walls of my home to the canvas in my studio, every painting becomes a thread in the ever-growing tapestry of Mithila women. The motifs I choose—two birds in harmony, swirling fishes, or the ever-watchful sun—are all symbols of love, prosperity, and resilience.\n\nToday, I share with you one of my favorite new works, “Lotus Pond and Divine Harmony,” painted using natural pigments and the ancestral technique. May it bring a touch of Mithila’s spirit to your heart.",
        "author": "Priya Sharma",
        "image": "uploads\\blog_20250723025647_Lotus.JPG",
        "timestamp": "2025-07-23 02:56:47.661067"
    },
    {
        "id": "20250723041858",
        "title": "“Echoes of the Forest” – My Voice in Gond Tradition",
        "content": " As an artist, I've always been moved by the quiet wisdom of nature — and Gond art lets me paint that dialogue with rhythmic dots and flowing lines. Born in the tribal regions of Madhya Pradesh, this style transforms animals, trees, and myths into living patterns.\nMy painting, Echoes of the Forest, features a majestic elephant adorned with geometric motifs, surrounded by birds and foliage that seem to hum with life. The composition reflects interconnection — between creature and canopy, tradition and imagination.\nUsing acrylic on paper, I follow the traditional Gond approach of filling forms with texture rather than realism. The elephant isn’t just a creature here — it’s a guardian, a memory bearer, and a symbol of strength wrapped in quiet grace.\nFor me, Gond art is meditation. Each line is intentional. Each color is a call to harmony. In a world that races, it teaches us to see slowly and feel deeply.",
        "author": "Riya Sharma",
        "image": null,
        "timestamp": "2025-07-23 04:18"
    }
]